package com.example.mosqu.funfood;

import android.annotation.SuppressLint;
import android.content.Intent;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ArrayAdapter;
import android.widget.ListView;
import android.widget.TextView;
import android.widget.Toast;

import com.google.gson.Gson;
import com.google.gson.reflect.TypeToken;

import java.util.ArrayList;
import java.util.List;

public class food extends AppCompatActivity {
    private ListView listview;
    private TextView mrt;
    private TextView tim;
    private ArrayAdapter<String> adapter;
    //private ArrayAdapter<String> item = new ArrayAdapter<String>();

    class Food {
        String name;
        float lat;
        float lon;
        String tel;
        String addr;
    }

    class Foods2 {
        String stat;
        String time;
        List<Food> foods;
    }


    String foodJson = "[{stat : \"南港展覽館\" , time : \"早午餐\", foods : [" +
            "        { name : \"Mr.papa Waffle&Cafe比利時鬆餅\", lat : 25.039479, lon : 121.578037,  tel : \"02 2759 3568\",  addr : \"台北市信義區松山路467號\"}," +
            "        { name : \"Mr.Old\", lat : 25.0404329, lon : 121.575506,  tel : \"02 8780 0039\",  addr : \"台北市信義區虎林街132巷44號\"}," +
            "        { name : \"城翔早午餐\", lat : 25.0402232, lon : 121.5750554,  tel : \"02 8786 9116\",  addr : \"台北市信義區虎林街132巷51號\"}" +
            "        ]}," +
            "        {stat : \"南港展覽館\" , time : \"下午茶\", foods : [" +
            "        { name : \"Ratio Coffee\", lat : 25.054209, lon : 121.617453999999,  tel : \"02 2766 0138\",  addr : \"台北市南港區富康街5號\"}," +
            "        { name : \"S one Cafe'\", lat : 25.0454001, lon : 121.586405199999,  tel : \"02 2789 2666\",  addr : \"台北市南港區東新街80巷10弄22號\"}" +
            "        ]}," +
            "        {stat : \"南港展覽館\" , time : \"聚餐\", foods : [" +
            "        { name : \"武侍酒日式居酒屋\", lat : 25.0550773, lon : 121.6145615,  tel : \"02 2653 6773\",  addr : \"台北市南港區南港路一段111號\"}," +
            "        { name : \"餡老滿\", lat : 25.0570938, lon : 121.6164733,  tel : \"02 2789 3423\",  addr : \"台北市南港區經貿二路66號樓之2\"}," +
            "        { name : \"樂雅樂\", lat : 25.0570938, lon : 121.6164733,  tel : \"02 2783 1861\",  addr : \"台北市南港區經貿二路66之1號\"}" +
            "        ]}," +
            "        {stat : \"南港\" , time : \"早午餐\", foods : [" +
            "        { name : \"貳樓\", lat : 25.0524855, lon : 121.6065925,  tel : \"02 2652 9168\",  addr : \"台北市南港區忠孝東路七段359號\"}," +
            "        { name : \"漾漾好時餐廳\", lat : 25.0525582, lon : 121.604517999999,  tel : \"02-26515858\",  addr : \"台北市南港區忠孝東路七段369號A棟,3F\"}" +
            "        ]}," +
            "        {stat : \"南港\" , time : \"下午茶\", foods : [" +
            "        { name : \"杏桃鬆餅屋\", lat : 25.0525582, lon : 121.604517999999,  tel : \"02 2652 9220\",  addr : \"台北市南港區忠孝東路七段369號2樓\"}," +
            "        { name : \"鼓豆咖啡\", lat : 25.0525582, lon : 121.604517999999,  tel : \"02 2652 9224\",  addr : \"台北市南港區忠孝東路七段369號\"}," +
            "        { name : \"Conch Baking 手作餅乾烘焙屋\", lat : 25.0525582, lon : 121.604517999999,  tel : \"02-2783-5499\",  addr : \"台北市南港區富康街1巷4號\"}," +
            "        { name : \"南港CHAFFEE\", lat : 25.0509233, lon : 121.5932929,  tel : \"(02) 2652-9036\",  addr : \"台北市南港區忠孝東路七段369號2樓\"}" +
            "        ]}," +
            "        {stat : \"南港\" , time : \"聚餐\", foods : [" +
            "        { name : \"敘日全日餐廳\", lat : 25.0524855, lon : 121.6065925,  tel : \"02 3518 3078\",  addr : \"台北市南港區忠孝東路七段359號7樓號\"}," +
            "        { name : \"大肆鍋物\", lat : 25.0525582, lon : 121.604517999999,  tel : \"02 2783 1377\",  addr : \"台北市南港區忠孝東路七段369號\"}," +
            "        { name : \"豆腐村 \", lat : 25.0522566, lon : 121.6037326,  tel : \"02 2652 9385\",  addr : \"台北市南港區忠孝東路七段299號\"}," +
            "        { name : \"高麗園韓式烤肉\", lat : 25.0522566, lon : 121.6037326,  tel : \"02 2652 9370\",  addr : \"台北市南港區忠孝東路七段299號\"}" +
            "        ]}," +
            "        {stat : \"昆陽\" , time : \"早午餐\", foods : [" +
            "        { name : \"Bocy Patisserie & Bistro\", lat : 25.0509233, lon : 121.5932929,  tel : \"02 2788 1838\",  addr : \"台北市南港區忠孝東路六段403巷1弄17號\"}," +
            "        { name : \"Routine\", lat : 25.0501083, lon : 121.587630999999,  tel : \"\",  addr : \"台北市南港區市民大道七段230號\"}" +
            "        ]}," +
            "        {stat : \"昆陽\" , time : \"下午茶\", foods : [" +
            "        { name : \"Bocy Patisserie & Bistro\", lat : 25.0501083, lon : 121.587630999999,  tel : \"02 2788 1838\",  addr : \"台北市南港區忠孝東路六段403巷1弄17號\"}," +
            "        { name : \"Routine\", lat : 25.0501083, lon : 121.587630999999,  tel : \"\",  addr : \"台北市南港區市民大道七段230號\"}" +
            "        ]}," +
            "        {stat : \"昆陽\" , time : \"聚餐\", foods : [" +
            "        { name : \"二郭頭\", lat : 25.0504702, lon : 121.595090499999,  tel : \"02 2788 6890\",  addr : \"115台北市南港區忠孝東路六路6段482號\"}," +
            "        { name : \"穀旦云涮涮鍋\", lat : 25.05046, lon : 121.594913599999,  tel : \"02-265-1551\",  addr : \"台北市南港區忠孝東路六段476號\"}" +
            "        ]},"+
            "        {stat : \"後山埤\" , time : \"早午餐\", foods : [" +
            "        { name : \"N+n 喫早餐\", lat : 25.039464, lon : 121.578796,  tel : \"02 2727 7786\",  addr : \"台北市信義區松山路465巷12號\"}," +
            "        { name : \"點子營養早餐吧\", lat : 25.042986, lon : 121.583665,  tel : \"02 2785 2157\",  addr : \"台北市南港區中坡南路45號\"}," +
            "        { name : \"藍色早餐吧\", lat : 25.0467144, lon : 121.582120199999,  tel : \"02 2651 8742\",  addr : \"台北市南港區玉成街66-27號\"}" +
            "        ]}," +
            "        {stat : \"後山埤\" , time : \"下午茶\", foods : [" +
            "        { name : \"布蘭梅德國下午茶館\", lat : 25.0396336, lon : 121.5568518,  tel : \"02 2773 6155\",  addr : \"台北市大安區光復南路278號號 1 樓\"}," +
            "        { name : \"茶香詩意\", lat : 25.043919, lon : 121.582736999999,  tel : \"02 2786 5902\",  addr : \"台北市南港區玉成街140巷25號\"}," +
            "        { name : \"味旅\", lat : 25.042488, lon : 121.568333899999,  tel : \"02 2768 0518\",  addr : \"台北市信義區永吉路30巷158弄9號\"}" +
            "        ]}," +
            "        {stat : \"後山埤\" , time : \"聚餐\", foods : [" +
            "        { name : \"輕鬆私房菜\", lat : 25.0431899, lon : 121.581457799999,  tel : \"02-2726-0126\",  addr : \"台北市信義區忠孝東路五段764號\"}," +
            "        { name : \"竹村居酒屋\", lat : 25.0256294, lon : 121.5692742,  tel : \"02 2720 7305\",  addr : \"110台北市信義區松仁路253巷1弄2號\"}" +
            "        ]}," +
            "        {stat : \"永春\" , time : \"早午餐\", foods : [" +
            "        { name : \"Mr.papa Waffle&Cafe比利時鬆餅\", lat : 25.039479, lon : 121.578037,  tel : \"02 2759 3568\",  addr : \"台北市信義區松山路467號\"}," +
            "        { name : \"Mr.Old\", lat : 25.0404329, lon : 121.575506,  tel : \"02 8780 0039\",  addr : \"台北市信義區虎林街132巷44號\"}," +
            "        { name : \"城翔早午餐\", lat : 25.0402232, lon : 121.5750554,  tel : \"02 8786 9116\",  addr : \"台北市信義區虎林街132巷51號\"}" +
            "        ]}," +
            "        {stat : \"永春\" , time : \"下午茶\", foods : [" +
            "        { name : \"聞山咖啡\", lat : 25.039788, lon : 121.576361,  tel : \"02 8789 6797\",  addr : \"台北市信義區忠孝東路五段372巷27弄73-1號\"}," +
            "        { name : \"咖竅 Cotcha Coffee\", lat : 25.040422, lon : 121.575343999999,  tel : \"02 8786 9730\",  addr : \"台北市 信義區 忠孝東路五段412-7號\"}," +
            "        { name : \"ERZMOMENT 笛瑟甜點工坊\", lat : 25.0372912, lon : 121.575429699999,  tel : \"02 2726 1310\",  addr : \"台北市信義區虎林街202巷66號\"}," +
            "        { name : \"Colive Tea\", lat : 25.0411042, lon : 121.5740339,  tel : \"02 2768 6768\",  addr : \"台北市信義區忠孝東路五段３４５巷１號 \"}" +
            "        ]}," +
            "        {stat : \"永春\" , time : \"聚餐\", foods : [" +
            "        { name : \"古記雞.信義店.私房菜居酒屋\", lat : 25.040532, lon : 121.572814,  tel : \"0953 175 577\",  addr : \"台北市信義區忠孝東路五段236巷3弄13號\"}," +
            "        { name : \"小人大食\", lat : 25.0407545, lon : 121.5790184,  tel : \"02- 2727- 8271\",  addr : \"台北市信義區松山路465巷27弄20號\"}," +
            "        { name : \"小鮮肉涮涮屋\", lat : 25.041645, lon : 121.578858999999,  tel : \"02-87851207\",  addr : \"台北市信義區忠孝東路五段613號\"}" +
            "        ]}," +
            "        {stat : \"市政府\" , time : \"早午餐\", foods : [" +
            "        { name : \"HIVE巢\", lat : 25.0402665, lon : 121.5629384,  tel : \"02 8786 0020\",  addr : \"台北市信義區逸仙路42巷19號\"}," +
            "        { name : \"We & Me Cafe\", lat : 25.0420282, lon : 121.5646547,  tel : \"02 2763 8767\",  addr : \"台北市信義區基隆路一段188-2號\"}" +
            "        ]}," +
            "        {stat : \"市政府\" , time : \"下午茶\", foods : [" +
            "        { name : \"LeTAO小樽洋?子舖\", lat : 25.043671, lon : 121.562915999999,  tel : \"02 2760 2100\",  addr : \"台北市信義區忠孝東路四段553巷30號\"}," +
            "        { name : \"佳佳甜品\", lat : 25.0427826, lon : 121.565668299999,  tel : \"02 2769 7998\",  addr : \"台北市信義區基隆路一段145-2號\"}" +
            "        ]}," +
            "        {stat : \"市政府\" , time : \"聚餐\", foods : [" +
            "        { name : \"韓姜熙的小廚房\", lat : 25.0387252, lon : 121.5672796,  tel : \"02 2729 5088\",  addr : \"台北市信義區松高路16號B2\"}," +
            "        { name : \"WOOSAN\", lat : 25.0425209, lon : 121.566462,  tel : \"02 2528 6389\",  addr : \"台北市信義區基隆路一段147巷15號\"}," +
            "        { name : \"韓斤麻浦\", lat : 25.0405044, lon : 121.5668964,  tel : \"02 2723 6066\",  addr : \"台北市信義區忠孝東路五段68號\"}," +
            "        { name : \"靜岡勝政日式豬排\", lat : 25.040569, lon : 121.565631599999,  tel : \"02 2722 0178\",  addr : \"台北市信義區忠孝東路五段8號B2\"}," +
            "        { name : \"丸龜製麵\", lat : 25.0387489, lon : 121.566670199999,  tel : \"02 2729 1658\",  addr : \"台北市信義區松高路12號B2\"}" +
            "        ]}," +
            "        {stat : \"國父紀念館\" , time : \"早午餐\", foods : [" +
            "        { name : \"At First Brunch 緣來早午餐\", lat : 25.0565355, lon : 121.519752599999,  tel : \"\",  addr : \"台北市大同區赤峰街59號\"}," +
            "        { name : \"Moi Cafe\", lat : 25.037229, lon : 121.556986199999,  tel : \"02 2704 0099\",  addr : \"台北市大安區仁愛路四段408巷13號\"}" +
            "        ]}," +
            "        {stat : \"國父紀念館\" , time : \"下午茶\", foods : [" +
            "        { name : \"微兜\", lat : 25.0398929, lon : 121.555657399999,  tel : \"02 2721 3008\",  addr : \"台北市大安區光復南路280巷40號\"}," +
            "        { name : \"Street Churros\", lat : 25.0403894, lon : 121.55644,  tel : \"02 2776 5663\",  addr : \"台北市大安區光復南路260巷24號\"}," +
            "        { name : \"下午茶\", lat : 25.0393355, lon : 121.556368799999,  tel : \"02 2721 5661\",  addr : \"光復南路290巷大安區台北市106\"}" +
            "        ]}," +
            "        {stat : \"國父紀念館\" , time : \"聚餐\", foods : [" +
            "        { name : \"alamode Tabl\", lat : 25.0399108, lon : 121.555444299999,  tel : \"02 2773 3455\",  addr : \"台北市大安區光復南路280巷44號\"}," +
            "        { name : \"Dancing Pig 豬跳舞小餐館\", lat : 25.0394878, lon : 121.555697,  tel : \"02 2731 6469\",  addr : \"台北市大安區光復南路290巷48號\"}," +
            "        { name : \"潭洞韓式燒烤餐廳\", lat : 25.0442176, lon : 121.5550848,  tel : \"02 2775 4195\",  addr : \"台北市大安區市民大道四段196號\"}," +
            "        { name : \"泰滾 Rolling Thai 泰式火鍋\", lat : 25.04137, lon : 121.546292,  tel : \"02 2751 5333\",  addr : \"台北市大安區台北市忠孝東路四段98號6樓\"}" +
            "        ]}," +
            "        {stat : \"忠孝敦化\" , time : \"早午餐\", foods : [" +
            "        { name : \"貓咪先生的朋友\", lat : 25.0410979, lon : 121.5465145,  tel : \"02-2731-8387\",  addr : \"台北市 大安路一段83巷3號A樓1F\"}," +
            "        { name : \"Pinknic野餐吧\", lat : 25.0400335, lon : 121.5536775,  tel : \"02-2711-0820\",  addr : \"台北市 大安區 忠孝東路四段216巷27弄9號\"}," +
            "        { name : \"初衣食午 One Fifteen\", lat : 25.0407298, lon : 121.5459751,  tel : \"02 8773 0115\",  addr : \"台北市 大安區 大安路一段92號\"}," +
            "        { name : \"BIG TIME美式靈魂早午餐\", lat : 25.0443242, lon : 121.544813299999,  tel : \"02-2731-8133\",  addr : \"台北市 大安區 復興南路一段107巷5弄13號\"}" +
            "        ]}," +
            "        {stat : \"忠孝敦化\" , time : \"下午茶\", foods : [" +
            "        { name : \"若水臨品鍋\", lat : 25.0442176, lon : 121.5550848,  tel : \"(02)2778-3222\",  addr : \"台北市 市民大道四段196號\"}," +
            "        { name : \"尚咖啡\", lat : 25.0414864, lon : 121.550844099999,  tel : \"02-2771-7969\",  addr : \"台北市 大安區 台北市大安區忠孝東路四段182號\"}," +
            "        { name : \"草莓工房\", lat : 25.0435165, lon : 121.546422899999,  tel : \"02-2741-6898\",  addr : \"台北市 大安區 敦化南路一段160巷62號\"}" +
            "        ]}," +
            "        {stat : \"忠孝敦化\" , time : \"聚餐\", foods : [" +
            "        { name : \"啤調客 Beeru\", lat : 25.0449644, lon : 121.5502007,  tel : \"02-2577-1815\",  addr : \"台北市 市民大道四段129號\"}," +
            "        { name : \"叁和院(參和院)台灣風格飲食\", lat : 25.0423964, lon : 121.5478898,  tel : \"(02)2731-3833\",  addr : \"台北市 忠孝東路四段101巷14號\"}," +
            "        { name : \"胖東西廚房 CoolZi\", lat : 25.0425008, lon : 121.5545838,  tel : \"02-8772-2893\",  addr : \"台北市 大安區 延吉街131巷2弄3號1樓\"}," +
            "        { name : \"花酒藏 A-Plus\", lat : 25.038737, lon : 121.550989999999,  tel : \"02-2731-9266\",  addr : \"台北市 大安區 安和路一段33號\"}" +
            "        ]}," +
            "        {stat : \"忠孝復興\" , time : \"早午餐\", foods : [" +
            "        { name : \"樂。野食\", lat : 25.042161, lon : 121.5406043,  tel : \"02 2752 3180\",  addr : \"台北市 忠孝東路三段217巷2弄16號\"}," +
            "        { name : \"紙箱外的貓腳印\", lat : 25.0409203, lon : 121.542361499999,  tel : \"02-2771-6553\",  addr : \"台北市 大安區 忠孝東路三段276巷10號\"}," +
            "        { name : \"悄悄好食\", lat : 25.0375125, lon : 121.5391669,  tel : \"(02)2708-0134\",  addr : \"台北市 仁愛路三段92號3樓\"}" +
            "        ]}," +
            "        {stat : \"忠孝復興\" , time : \"下午茶\", foods : [" +
            "        { name : \"紅豆食府\", lat : 25.040247, lon : 121.5483374,  tel : \"02-8771-5511\",  addr : \"台北市 敦化南路一段246號B2樓\"}," +
            "        { name : \"PINEDE\", lat : 25.0414352, lon : 121.5411621,  tel : \"27400101\",  addr : \"台北市大安區忠孝東路三段244號\"}," +
            "        { name : \"Tartine Bakery\", lat : 25.0385694, lon : 121.552047899999,  tel : \"27788831\",  addr : \"台北市安河路一段49巷13-1號\"}" +
            "        ]}," +
            "        {stat : \"忠孝復興\" , time : \"聚餐\", foods : [" +
            "        { name : \"菜豚屋\", lat : 25.0472369, lon : 121.546156,  tel : \"02 2778 8055\",  addr : \"台北市 松山區 八德路二段410巷16弄8號\"}," +
            "        { name : \"川巴子熱炒\", lat : 25.0446891, lon : 121.544741499999,  tel : \"02 2711 0985\",  addr : \"台北市 大安區 市民大道四段20號\"}," +
            "        { name : \"WOODSTONE 木石披薩餐廳\", lat : 25.04137, lon : 121.546292,  tel : \"02-6638-5899\",  addr : \"台北市 忠孝東路四段98號9樓\"}" +
            "        ]}," +
            "        {stat : \"忠孝新生\" , time : \"早午餐\", foods : [" +
            "        { name : \"光合箱子\", lat : 25.0441499, lon : 121.529440799999,  tel : \"23568661\",  addr : \"台北市中正區八德路一段1號\"}," +
            "        { name : \"天和鮮物\", lat : 25.0454929, lon : 121.526767,  tel : \"23516268\",  addr : \"台北市北平東路30號\"}," +
            "        { name : \"以馬內利鮮魚湯\", lat : 25.0433039, lon : 121.5270178,  tel : \"\",  addr : \"台北市中正區杭州南路一段11巷內\"}," +
            "        { name : \"杭州小籠包\", lat : 25.034063, lon : 121.523728,  tel : \"23935875\",  addr : \"台北市杭州南路二段17號(金甌女中旁)\"}" +
            "        ]}," +
            "        {stat : \"忠孝新生\" , time : \"下午茶\", foods : [" +
            "        { name : \"遠流別境 libLAB\", lat : 25.0441499, lon : 121.529440799999,  tel : \"23958848\",  addr : \"台北市八德路一段1號\"}," +
            "        { name : \"幾米品牌概念店\", lat : 25.0441499, lon : 121.529440799999,  tel : \"55769125\",  addr : \"台北市八德路一段1號\"}," +
            "        { name : \"建北黑砂糖剉冰\", lat : 25.039643, lon : 121.523456099999,  tel : \"23581108\",  addr : \"台北市中正區林森南路61巷25號(紹興南街與丹陽街口)\"}," +
            "        { name : \"貓下去 MEOWVELOUS CAFÉ\", lat : 25.0405662, lon : 121.523703299999,  tel : \"23222364\",  addr : \"台北市中正區徐州路38號\"}" +
            "        ]}," +
            "        {stat : \"忠孝新生\" , time : \"聚餐\", foods : [" +
            "        { name : \"小姑食記\", lat : 25.0486229, lon : 121.522306999999,  tel : \"(02) 2521-6801\",  addr : \"台北市中山區中山北路一段33巷26號1樓\"}," +
            "        { name : \"橋下大叔\", lat : 25.0463298, lon : 121.530622999999,  tel : \" 02 2567 8904\",  addr : \"104台北市中山區新生北路一段62巷16號\"}," +
            "        { name : \"陳記燒臘\", lat : 25.0400321, lon : 121.5322946,  tel : \"23568283\",  addr : \"台北市濟南路二段62巷三號\"}" +
            "        ]}," +
            "        {stat : \"善導寺\" , time : \"早午餐\", foods : [" +
            "        { name : \"烤司院碳烤吐司專賣\", lat : 25.0484271, lon : 121.522421,  tel : \"02-25638360\",  addr : \"台北市 中山區 天津街16號\"}," +
            "        { name : \"阜杭豆漿\", lat : 25.0443528, lon : 121.5246035,  tel : \"02-2392-2175\",  addr : \"台北市 中正區 忠孝東路一段108號 2樓之28\"}," +
            "        { name : \"丘比手作吐司早午餐\", lat : 25.0443528, lon : 121.5246035,  tel : \"02-2321-5838\",  addr : \"台北市 中正區 忠孝東路一段108號2樓\"}," +
            "        { name : \"艾搗蛋手工蛋餅\", lat : 25.0436656, lon : 121.5247617,  tel : \"02-2351-5707\",  addr : \"台北市 紹興南街4-2號\"}" +
            "        ]}," +
            "        {stat : \"善導寺\" , time : \"下午茶\", foods : [" +
            "        { name : \"二條通綠島小夜曲\", lat : 25.048886, lon : 121.521556299999,  tel : \"02-2531-4594\",  addr : \"台北市 中山北路一段33巷1號\"}," +
            "        { name : \"Monteur 夢甜屋洋菓子店\", lat : 25.0529936, lon : 121.5210517,  tel : \"02 2567 9125\",  addr : \"台北市 中山區 中山北路二段16巷22號\"}," +
            "        { name : \"KONAYUKI 粉雪北海道 Style Cafe\", lat : 25.0535937, lon : 121.522081099999,  tel : \"02-2522-2020\",  addr : \"台北市 中山區 中山北路二段20巷1號3樓\"}," +
            "        { name : \"Bonnie Sugar\", lat : 25.0465667, lon : 121.523505099999,  tel : \"223935606\",  addr : \"台北市 中正區 北平東路9號\"}" +
            "        ]}," +
            "        {stat : \"善導寺\" , time : \"聚餐\", foods : [" +
            "        { name : \"天糖時尚燉奶甜品\", lat : 25.0511167, lon : 121.523782799999,  tel : \"(02)25431902\",  addr : \"台北市 中山區 中山北路一段121巷15號\"}," +
            "        { name : \"青葉新樂園\", lat : 25.0441499, lon : 121.529440799999,  tel : \"02-3322-2009\",  addr : \"台北市 八德路一段1號\"}," +
            "        { name : \"美麗島沖繩風味居酒屋\", lat : 25.051339, lon : 121.522839999999,  tel : \"02-2536-8597\",  addr : \"台北市 中山北路一段121巷1-2號\"}" +
            "        ]}," +
            "        {stat : \"台北車站\" , time : \"早午餐\", foods : [" +
            "        { name : \"蛋要酷手工蛋餅專賣店\", lat : 25.0445232, lon : 121.5154511,  tel : \"02-2312-2300\",  addr : \"台北市 中正區 信陽街26-4號\"}," +
            "        { name : \"Nola Kitchen 紐澳良小廚\", lat : 25.044295, lon : 121.5230606,  tel : \"(02)3393-7662\",  addr : \"台北市 中正區 林森南路2號巷子內\"}," +
            "        { name : \"Tame Moose\", lat : 25.051918, lon : 121.519935,  tel : \"02 2556 5908\",  addr : \"台北市 大同區 南京西路18巷6弄6號1樓\"}," +
            "        { name : \"Coco Brother 椰 兄弟\", lat : 25.054557, lon : 121.520819,  tel : \"02 2563 9086\",  addr : \"台北市 中山區 中山北路二段42巷38號\"}" +
            "        ]}," +
            "        {stat : \"台北車站\" , time : \"下午茶\", foods : [" +
            "        { name : \"小器食堂\", lat : 25.054102, lon : 121.519393,  tel : \"02-25596851\",  addr : \"台北市 大同區 赤峰街27號\"}," +
            "        { name : \"Dazzling Cafe 蜜糖吐司\", lat : 25.047702, lon : 121.5173735,  tel : \"02 2388 1966\",  addr : \"台北市 中正區 北平西路3號2樓\"}," +
            "        { name : \"DIAMOND BEAR 鑽石熊烘焙\", lat : 25.0517728, lon : 121.5125866,  tel : \"(02)2552-3328\",  addr : \"台北市 大同區 長安西路294號\"}," +
            "        ]}," +
            "        {stat : \"台北車站\" , time : \"聚餐\", foods : [" +
            "        { name : \"明德素食園\", lat : 25.049308, lon : 121.5171935,  tel : \"02-2559-5008\",  addr : \"台北市 大同區 承德路一段1號B3\"}," +
            "        { name : \"元泰食創意料理\", lat : 25.0443988, lon : 121.514763799999,  tel : \"02-2331-5789\",  addr : \"台北市 中正區 館前路42號B1\"}," +
            "        { name : \"Nancy No.6 Apt 南西六號公寓\", lat : 25.0523026, lon : 121.519784299999,  tel : \"02 2555 2046\",  addr : \"台北市 中山區 南京西路18巷4弄6之1號1樓\"}" +
            "        ]}," +
            "        {stat : \"西門\" , time : \"早午餐\", foods : [" +
            "        { name : \"貳拾陸巷 Somebody Café\", lat : 25.042924, lon : 121.505744999999,  tel : \"02 2311 2371\",  addr : \"台北市 萬華區 成都路65號\"}," +
            "        { name : \"花嘴廚房\", lat : 25.0407349, lon : 121.504294999999,  tel : \"02 2361 6998\",  addr : \"台北市 萬華區 昆明街214號之1\"}," +
            "        { name : \"In% HAIR Salon & café\", lat : 25.043239, lon : 121.505964899999,  tel : \"02-2311-6065\",  addr : \"台北市 萬華區 西寧南路76號2~5樓\"}," +
            "        { name : \"金花碳烤吐司專賣\", lat : 25.041631, lon : 121.506518,  tel : \"0905 663 001\",  addr : \"台北市 萬華區 內江街17號\"}" +
            "        ]}," +
            "        {stat : \"西門\" , time : \"下午茶\", foods : [" +
            "        { name : \"Guru House\", lat : 25.0430594, lon : 121.506814599999,  tel : \"02 2361 2522\",  addr : \" 台北市成都路27巷萬華區\"}," +
            "        { name : \"八拾捌茶輪番所\", lat : 25.040365, lon : 121.507264999999,  tel : \"02-23120845\",  addr : \"台北市 萬華區 中華路一段 174 號\"}," +
            "        { name : \"譚仔三哥米線\", lat : 25.043259, lon : 121.507454999999,  tel : \"02 2381 3397\",  addr : \"台北市 萬華區 漢中街107號\"}," +
            "        { name : \"點水樓\", lat : 25.043905, lon : 121.514020999999,  tel : \"02-2312-3100\",  addr : \"台北市 懷寧街64號\"}," +
            "        { name : \"武昌街老天祿滷味\", lat : 25.0447755, lon : 121.5072417,  tel : \"02 2361-5588\",  addr : \"台北市萬華區武昌街二段55號\"}" +
            "        ]}," +
            "        {stat : \"西門\" , time : \"聚餐\", foods : [" +
            "        { name : \"amba意舍吃吧chiba\", lat : 25.0451617, lon : 121.5055717,  tel : \"02-2375-2075\",  addr : \"台北市 大安區 武昌街2段77號5樓\"}," +
            "        { name : \"梅村日本料理\", lat : 25.0421759, lon : 121.511210099999,  tel : \"02-2331-1774\",  addr : \"台北市 衡陽路74號\"}," +
            "        { name : \"嚐飽圖\", lat : 25.0453265, lon : 121.5053333,  tel : \"02-2381-8368\",  addr : \"台北市 萬華區 昆明街86號2樓\"}," +
            "        { name : \"打狗霸\", lat : 25.0464563, lon : 121.5055677,  tel : \"02 2331 3677\",  addr : \"台北市 昆明街46號\"}" +
            "        ]}," +
            "        {stat : \"龍山寺\" , time : \"早午餐\", foods : [" +
            "        { name : \"NEST burger\", lat : 25.0391994, lon : 121.499719499999,  tel : \"02-2331-8891\",  addr : \"臺北市萬華區西園路一段80號1F\"}," +
            "        { name : \"日初Moni Café\", lat : 25.0396985, lon : 121.5020451,  tel : \"02-2388-9768\",  addr : \"台北市萬華區康定路93號\"}," +
            "        { name : \"煮飯研究所\", lat : 25.0316598, lon : 121.5054413,  tel : \"02 23025389\",  addr : \"台北市中正區大埔街向7-1號\"}" +
            "        ]}," +
            "        {stat : \"龍山寺\" , time : \"下午茶\", foods : [" +
            "        { name : \"蘇家肉圓油粿\", lat : 25.0361606, lon : 121.5009359,  tel : \"02 2308-3724\",  addr : \"台北市萬華區三水街109號\"}," +
            "        { name : \"豐原排骨酥\", lat : 25.0366442, lon : 121.4986473,  tel : \"975761993\",  addr : \"台北市萬華廣州街180號\"}," +
            "        { name : \"布袋鮮之蚵 \", lat : 25.0351866, lon : 121.497124799999,  tel : \"02 23088463\",  addr : \"台北市萬華和平西路三段198號\"}," +
            "        { name : \"三六仔圓店\", lat : 25.0360536, lon : 121.5005168,  tel : \"02 23063765 \",  addr : \"台北市萬華三水街92號\"}" +
            "        ]}," +
            "        {stat : \"龍山寺\" , time : \"聚餐\", foods : [" +
            "        { name : \"艋舺夜市 / 蔥抓餅\", lat : 25.0365228, lon : 121.503531,  tel : \"\",  addr : \"台北市萬華區廣州街（入口處第一攤）\"}," +
            "        { name : \"艋舺夜市 / 山豬肉香腸\", lat : 25.0365228, lon : 121.503531,  tel : \"\",  addr : \"台北市萬華區廣州街\"}," +
            "        { name : \" 艋舺夜市 / 東港旗魚黑輪\", lat : 25.0365228, lon : 121.503531,  tel : \"\",  addr : \"台北市萬華區廣州街 (廣州街與梧州街交叉口附近)\"}," +
            "        { name : \"懷念愛玉冰\", lat : 25.0366788, lon : 121.4974631,  tel : \"\",  addr : \"台北市萬華區廣州街202之1號\"}," +
            "        { name : \"北港甜湯\", lat : 25.0373995, lon : 121.498400299999,  tel : \"(02)2302-3281\",  addr : \"台北市萬華區華西街41號\"}" +
            "        ]}," +
            "        {stat : \"江子翠\" , time : \"早午餐\", foods : [" +
            "        { name : \"石頭肉圓\", lat : 25.0310378, lon : 121.4744646,  tel : \"(02) 2251-2473\",  addr : \"新北市板橋區文化路二段410巷11號\"}," +
            "        { name : \"厝邊\", lat : 25.0303195, lon : 121.469198,  tel : \"(02)2252-1637\",  addr : \"新北市板橋區松江街118號\"}," +
            "        { name : \"無店名蛋餅\", lat : 25.0293891, lon : 121.474079899999,  tel : \"\",  addr : \"新北市板橋區松柏街4號 \"}," +
            "        { name : \"老王豆漿店\", lat : 25.0338549, lon : 121.4733283,  tel : \"(02)2252-2957\",  addr : \"新北市板橋區長江路三段52號\"}" +
            "        ]}," +
            "        {stat : \"江子翠\" , time : \"下午茶\", foods : [" +
            "        { name : \"艾白旅生 Alba Cafe\", lat : 25.031146, lon : 121.472671999999,  tel : \"02 8257 0228\",  addr : \"新北市 板橋區 雙十路3段10巷24號1樓\"}," +
            "        { name : \"Mr. Butter 奶油先生\", lat : 25.0304619, lon : 121.4689719,  tel : \"0975 298 627\",  addr : \"新北市 板橋區 松江街107號\"}," +
            "        { name : \"藍色微光\", lat : 25.0297393, lon : 121.4689321,  tel : \"\",  addr : \"新北市 板橋區 文化路二段225巷72弄60號\"}" +
            "        ]}," +
            "        {stat : \"江子翠\" , time : \"聚餐\", foods : [" +
            "        { name : \"Oyami Café\", lat : 25.0318077, lon : 121.4762917,  tel : \"02-2259-6585\",  addr : \"新北市 板橋區 仁化街84號\"}," +
            "        { name : \"彭園湘菜館\", lat : 25.0294219, lon : 121.4727311,  tel : \"02-2250-7568\",  addr : \"新北市 板橋區 雙十路二段239號4樓\"}," +
            "        { name : \"9%酒趴旋轉串燒Bar\", lat : 25.0308491, lon : 121.4728505,  tel : \"(02)82511709\",  addr : \"新北市 板橋區 文化路二段357號\"}," +
            "        { name : \"鉄工場專賣燒肉\", lat : 25.0226626, lon : 121.468744499999,  tel : \"02-2251-5008\",  addr : \"新北市 板橋區 民生路2段232號1樓之14\"}" +
            "        ]}," +
            "        {stat : \"新埔\" , time : \"早午餐\", foods : [" +
            "        { name : \"OVEN COFFEE\", lat : 25.0249596, lon : 121.4697476,  tel : \" 02-22500273\",  addr : \"新北市 板橋區 莒光路7號\"}," +
            "        { name : \"咖樂 Show the Color\", lat : 25.0207421, lon : 121.467925799999,  tel : \"02 8259 5908\",  addr : \" 新北市 板橋區 文化路一段270巷3弄12號1樓\"}," +
            "        { name : \"甜福Fuku Brunch\", lat : 25.0277066, lon : 121.4687306,  tel : \"02-82536066\",  addr : \"新北市 板橋區 松江街70號\"}," +
            "        { name : \"PUCHI LOFT 小倉庫早午餐\", lat : 25.0206135, lon : 121.4682933,  tel : \"02-2251-1590\",  addr : \" 新北市 板橋區 文化路一段270巷3弄26號\"}," +
            "        { name : \"FOUND HOUSE 方屋餐廳\", lat : 25.0202649, lon : 121.466894,  tel : \"(02) 2259-5050\",  addr : \"新北市 板橋區 介壽街2號\"}" +
            "        ]}," +
            "        {stat : \"新埔\" , time : \"下午茶\", foods : [" +
            "        { name : \"MATTER CAFÉ\", lat : 25.0219672, lon : 121.4677575,  tel : \"\",  addr : \"新北市 板橋區 文化路一段316號1樓\"}," +
            "        { name : \"翁林林Café\", lat : 25.0224557, lon : 121.4700463,  tel : \"02-82521863\",  addr : \"新北市 板橋區 民生路二段234巷24弄6號\"}," +
            "        { name : \"182 Pancake\", lat : 25.0273066, lon : 121.468553199999,  tel : \" 02-8252-0789\",  addr : \"新北市 板橋區 松江街45號\"}," +
            "        { name : \"巷左轉\", lat : 25.021155, lon : 121.467577,  tel : \"02 2257 4406\",  addr : \"新北市 板橋區 文化路一段270巷1弄3號\"}" +
            "        ]}," +
            "        {stat : \"新埔\" , time : \"聚餐\", foods : [" +
            "        { name : \"NU PASTA杯杯麵\", lat : 25.022402, lon : 121.465143,  tel : \" 02-22535586\",  addr : \"新北市 板橋區 陽明街56號\"}," +
            "        { name : \"長鼻子泰式咖哩\", lat : 25.0252456, lon : 121.4689482,  tel : \"02 2250 8189\",  addr : \"新北市 板橋區 文化路二段45號\"}," +
            "        { name : \"Box Diner\", lat : 25.020696, lon : 121.462512999999,  tel : \" 02 8252 3510\",  addr : \" 新北市 板橋區 新海路7號\"}," +
            "        { name : \"鄰居家 Next Door\", lat : 25.0303195, lon : 121.469198,  tel : \"02-2252-1637\",  addr : \" 新北市 板橋區 松江街118號\"}," +
            "        { name : \"豐華小館\", lat : 25.0290517, lon : 121.473331899999,  tel : \" 02-8252-9789\",  addr : \"新北市 板橋區 雙十路二段209號\"}" +
            "        ]}," +
            "        {stat : \"板橋\" , time : \"早午餐\", foods : [" +
            "        { name : \"TOAST BOX\", lat : 25.013513, lon : 121.466497,  tel : \"\",  addr : \"新北市 板橋區 28號B1\"}," +
            "        { name : \"Hivi Brunch\", lat : 25.0175383, lon : 121.459863499999,  tel : \"02-2275-1129\",  addr : \"新北市 板橋區 建國街99號\"}," +
            "        { name : \"好初早餐 Deli\", lat : 25.0175321, lon : 121.4610103,  tel : \"02-29691587\",  addr : \"新北市 板橋區 建國街118號\"}," +
            "        { name : \"N.Y. BAGELS\", lat : 25.0143985, lon : 121.4634922,  tel : \"02-8969-1669\",  addr : \"新北市 板橋區 縣民大道二段7號2樓\"}," +
            "        { name : \"merci café\", lat : 25.0106464, lon : 121.4637877,  tel : \" 02-89533906\",  addr : \"新北市 板橋區 新民街7巷29號\"}" +
            "        ]}," +
            "        {stat : \"板橋\" , time : \"下午茶\", foods : [" +
            "        { name : \"亞尼克果子工房\", lat : 25.0143985, lon : 121.4634922,  tel : \"(02)8969-3561\",  addr : \"新北市 板橋區 縣民大道二段7號1F (環球板橋店)\"}," +
            "        { name : \"跳舞香水perfume dance\", lat : 25.0109601, lon : 121.4644536,  tel : \"02 8978-1767\",  addr : \"新北市 板橋區 中山路一段152號4樓\"}," +
            "        { name : \"典藏33\", lat : 25.0122763, lon : 121.465536899999,  tel : \"(02) 29550633\",  addr : \"新北市 板橋區 中山路一段161號33樓\"}," +
            "        { name : \"Awhile 外兒小館\", lat : 25.0140978, lon : 121.460423699999,  tel : \"02-2272-1030\",  addr : \"新北市 板橋區 文化路一段45巷18號\"}," +
            "        { name : \"糖村\", lat : 25.013651, lon : 121.466765,  tel : \" 02-2951 6968\",  addr : \" 新北市 板橋區 新站路28號B1\"}" +
            "        ]}," +
            "        {stat : \"板橋\" , time : \"聚餐\", foods : [" +
            "        { name : \"梁季港式小火鍋\", lat : 25.0194773, lon : 121.46612,  tel : \"02 8259 6428\",  addr : \"新北市板橋區文化路一段188巷20號\"}," +
            "        { name : \"AIYA 藍屋日本料理\", lat : 25.013651, lon : 121.466765,  tel : \"02-2951-3595\",  addr : \" 新北市 板橋區 新站路28號9F\"}," +
            "        { name : \"聚．北海道昆布鍋\", lat : 25.0143985, lon : 121.4634922,  tel : \"02-8969-3369\",  addr : \" 新北市 板橋區 縣民大道2段7號2樓\"}," +
            "        { name : \"Howfun 好飯食堂\", lat : 25.0143985, lon : 121.4634922,  tel : \"02-7728-5688\",  addr : \" 新北市 板橋區 縣民大道二段7號2樓\"}," +
            "        { name : \"開飯川食堂\", lat : 25.0109601, lon : 121.4644536,  tel : \"02-2952-8188\",  addr : \" 新北市 板橋區 中山路一段152號13F\"}" +
            "        ]}," +
            "        {stat : \"府中\" , time : \"早午餐\", foods : [" +
            "        { name : \"灣島 呷早頓\", lat : 25.0107046, lon : 121.455888899999,  tel : \"02-29601322\",  addr : \"新北市 板橋區 文昌街22號\"}," +
            "        { name : \"第46號倉庫早午餐\", lat : 25.0058187, lon : 121.459484799999,  tel : \"02 2958 8857\",  addr : \" 新北市 板橋區 四川路一段46號\"}," +
            "        { name : \"板橋三隻小豬\", lat : 25.0058097, lon : 121.460492599999,  tel : \"(02)29530917\",  addr : \"新北市 板橋區 後埔街54號\"}," +
            "        { name : \"Vicking's cafe 維京女王\", lat : 25.0024443, lon : 121.455743499999,  tel : \"02-2957-0700\",  addr : \"新北市 板橋區 貴興路117號\"}," +
            "        { name : \"野豬核桃早午餐\", lat : 24.9943091, lon : 121.453575199999,  tel : \"02-2952-6308\",  addr : \"新北市 板橋區 民族路42號\"}" +
            "        ]} ," +
            "        {stat : \"府中\" , time : \"下午茶\", foods : [" +
            "        { name : \"Caffe bene\", lat : 25.0057485, lon : 121.459492599999,  tel : \"(02) 2953－2789\",  addr : \"新北市 板橋區 四川路一段50號1樓\"}," +
            "        { name : \"Wapasta 義磚義瓦\", lat : 25.0097668, lon : 121.4622421,  tel : \"02-2961-0550\",  addr : \" 新北市 板橋區 民族路33號\"}," +
            "        { name : \"Melbourne Press Café\", lat : 25.0071059, lon : 121.461915999999,  tel : \"02 2959 5936\",  addr : \"新北市 板橋區 重慶路67號\"}," +
            "        { name : \"Jouons Ensemble Pâtisserie\", lat : 25.0027858, lon : 121.456038,  tel : \"02-29588806\",  addr : \"新北市 板橋區 貴興街86號\"}," +
            "        { name : \"微時光\", lat : 25.0124447, lon : 121.463260699999,  tel : \"02 6637 5366\",  addr : \"新北市 板橋區 縣民大道二段66號1樓\"}" +
            "        ]}," +
            "        {stat : \"府中\" , time : \"聚餐\", foods : [" +
            "        { name : \"原燒\", lat : 25.0074218, lon : 121.462400699999,  tel : \"02-2959-8558\",  addr : \"新北市 板橋區 館前東路96號1樓\"}," +
            "        { name : \"六必居潮州沙鍋粥\", lat : 25.0099614, lon : 121.4628396,  tel : \"02-2952-8813\",  addr : \"新北市 板橋區 民權路3號\"}," +
            "        { name : \"隱居 いざかや居酒屋\", lat : 25.0084706, lon : 121.4580633,  tel : \"02-8969-8260\",  addr : \"新北市 板橋區 東門街30-1號\"}," +
            "        { name : \"新野町燒肉居酒屋\", lat : 25.0095295, lon : 121.461818,  tel : \"02 2956 6850\",  addr : \"新北市 板橋區 民族路34巷10號\"}," +
            "        { name : \"新葡苑餐廳\", lat : 25.013651, lon : 121.466765,  tel : \"(02)8951-0388\",  addr : \" 新北市 板橋區 新站路28號9樓\"}" +
            "        ]}," +
            "        {stat : \"亞東醫院\" , time : \"早午餐\", foods : [" +
            "        { name : \"向陽晨間飲食館\", lat : 25.0024443, lon : 121.455743499999,  tel : \"02 8966 2012\",  addr : \"新北市 板橋區 四川路二段47巷4弄17號\"}," +
            "        { name : \"有乾人麻辣火鍋\", lat : 25.0024443, lon : 121.455743499999,  tel : \" 02-2957-0700\",  addr : \"新北市 板橋區 貴興路117號\"}," +
            "        { name : \"花吃\", lat : 24.9994091, lon : 121.4584155,  tel : \"(02)29527252\",  addr : \"新北市 板橋區 仁愛路2號\"}," +
            "        { name : \"多來家CAFÉ\", lat : 24.9936843, lon : 121.4535086,  tel : \"02-8967-6310\",  addr : \"新北市 板橋區 德興街35號\"}" +
            "        ]}," +
            "        {stat : \"亞東醫院\" , time : \"下午茶\", foods : [" +
            "        { name : \"NU PASTA杯杯麵\", lat : 24.996287, lon : 121.451344999999,  tel : \"02-89663558\",  addr : \"新北市 板橋區 南雅南路二段144巷2號\"}," +
            "        { name : \"米迦千層乳酪蛋糕專賣店\", lat : 24.9956529, lon : 121.4587457,  tel : \"02-8964-2112\",  addr : \"新北市 板橋區 國慶路27號\"}," +
            "        { name : \"歐客佬咖啡農場\", lat : 24.9997321, lon : 121.458418199999,  tel : \" 02-2955-1919\",  addr : \"新北市 板橋區 四川路1段361號\"}," +
            "        { name : \"稻町森法式甜點舖\", lat : 25.0027858, lon : 121.456038,  tel : \"02-29588806\",  addr : \"新北市 板橋區 貴興街86號\"}" +
            "        ]}," +
            "        {stat : \"亞東醫院\" , time : \"聚餐\", foods : [" +
            "        { name : \"薩莉亞義式餐廳\", lat : 24.9982095, lon : 121.452038,  tel : \"02 8966 1200\",  addr : \"台灣新北板橋區南雅南路二段122-23號B1\"}," +
            "        { name : \"舒果\", lat : 24.9988643, lon : 121.4565081,  tel : \" 02 2959 8590\",  addr : \"台灣新北遠東路1號板橋區220\"}," +
            "        { name : \"哈瓦那\", lat : 24.994941, lon : 121.450104,  tel : \" 02 8967 6985\",  addr : \"台灣新北板橋區南雅南路二段144巷87號\"}" +
            "        ]}," +
            "        {stat : \"海山\" , time : \"早午餐\", foods : [" +
            "        { name : \"早安公雞\", lat : 24.984263, lon : 121.445242,  tel : \"02 8261 6068\",  addr : \"新北市 土城區 明德路二段106號\"}," +
            "        { name : \"Homa 咖啡\", lat : 24.9830623, lon : 121.4551434,  tel : \"02 2262 8322\",  addr : \"新北市 土城區 裕民路259巷3號1樓\"}," +
            "        { name : \"怡客咖啡\", lat : 24.9835198, lon : 121.456757799999,  tel : \"02 22621612\",  addr : \"新北市 土城區 金城路二段247-1號\"}" +
            "        ]}," +
            "        {stat : \"海山\" , time : \"下午茶\", foods : [" +
            "        { name : \"醍味咖啡簡餐下午茶\", lat : 24.9870024, lon : 121.4543991,  tel : \" 02-2265-6763\",  addr : \" 新北市 土城區 學府路一段156號\"}," +
            "        { name : \"馬可先生麵包坊\", lat : 24.9786819, lon : 121.443338,  tel : \"02-2262-7995\",  addr : \"新北市 土城區 中央路二段61巷27號\"}," +
            "        { name : \"ANTLER PARK 鹿角公園\", lat : 24.9781442, lon : 121.442730999999,  tel : \"02 2263 6606\",  addr : \"新北市 土城區 員林街7號\"}" +
            "        ]}," +
            "        {stat : \"海山\" , time : \"聚餐\", foods : [" +
            "        { name : \"彼得公雞地中海餐廳\", lat : 24.9865772, lon : 121.4498893,  tel : \"02-2273-9966\",  addr : \" 新北市 土城區 裕民路92巷16弄2號\"}," +
            "        { name : \"漉\", lat : 24.9787201, lon : 121.4451146,  tel : \"(02)2260-6155\",  addr : \"新北市 土城區 學府路二段210號B2F\"}," +
            "        { name : \"阿城鵝肉\", lat : 24.9816791, lon : 121.456798299999,  tel : \" 02-8261-9747\",  addr : \"新北市 土城區 清水路78號\"}" +
            "        ]}," +
            "        {stat : \"土城\" , time : \"早午餐\", foods : [" +
            "        { name : \"蕃茄村漢堡\", lat : 24.986002, lon : 121.463841499999,  tel : \"02-22646213\",  addr : \" 新北市 土城區 金城路1段47-49號\"}" +
            "        ]}," +
            "        {stat : \"土城\" , time : \"下午茶\", foods : [" +
            "        { name : \"找餐先生\", lat : 24.9938695, lon : 121.462305399999,  tel : \"02 8953 1855\",  addr : \"新北市板橋區廣和街70號\"}" +
            "        ]}," +
            "        {stat : \"土城\" , time : \"聚餐\", foods : [" +
            "        { name : \"饗饌\", lat : 24.974071, lon : 121.444885,  tel : \"02 8273 3115\",  addr : \" 新北市 土城區 金城路一段131號\"}," +
            "        { name : \"御廚巨籠宴\", lat : 24.9808948, lon : 121.440078999999,  tel : \" 02-2262-2722\",  addr : \" 新北市 土城區 中華路一段208號\"}," +
            "        { name : \"石頭日式炭火燒肉\", lat : 24.9690922, lon : 121.438913899999,  tel : \"02-22675616\",  addr : \"新北市 土城區 中央路三段73號\"}" +
            "        ]}," +
            "        {stat : \"永寧\" , time : \"早午餐\", foods : [" +
            "        { name : \"紫的寶\", lat : 24.964989, lon : 121.4341438,  tel : \"02 2268 2678\",  addr : \"新北市土城區永安街9-1號\"}," +
            "        { name : \"金食堂 三隻熊\", lat : 24.9777079, lon : 121.4430921,  tel : \"\",  addr : \"新北市土城區員林街10-2號\"}" +
            "        ]}," +
            "        {stat : \"永寧\" , time : \"下午茶\", foods : [" +
            "        { name : \"AMO阿默典藏蛋糕\", lat : 24.9646311, lon : 121.438378899999,  tel : \"(02) 8076-3598\",  addr : \"新北市 土城區 忠承路109號1樓\"}" +
            "        ]}," +
            "        {stat : \"永寧\" , time : \"聚餐\", foods : [" +
            "        { name : \"永寧二號出口牛肉麵\", lat : 24.9660008, lon : 121.4362968,  tel : \"02 2269 0308\",  addr : \"新北市土城區承天路9號\"}," +
            "        { name : \"泰之雲泰式料理\", lat : 24.9668316, lon : 121.4358213,  tel : \"02 2267 1367\",  addr : \"新北市土城區中央路三段92號\"}," +
            "        { name : \"和春日式料理\", lat : 24.9674275, lon : 121.436378999999,  tel : \" 02 2269 7746\",  addr : \"新北市土城區中央路三段72之1號之 號\"}," +
            "        { name : \"五八烏龍麵\", lat : 24.9676858, lon : 121.436752599999,  tel : \" 0987 577 361\",  addr : \"新北市土城區中央路三段58號號\"}," +
            "        { name : \"幸福咖哩\", lat : 24.967448, lon : 121.436409299999,  tel : \"\",  addr : \"台北縣土城市中央路三段72-1號\"}" +
            "        ]}," +
            "        {stat : \"頂埔\" , time : \"早午餐\", foods : [" +
            "        { name : \"彎Corner\", lat : 24.95987, lon : 121.417771,  tel : \"0973 454 150\",  addr : \"新北市土城區頂埔街95號\"}," +
            "        { name : \"福利早餐店\", lat : 24.9603747, lon : 121.4198053,  tel : \"02 2267 0124\",  addr : \"新北市土城區中央路四段58-3號\"}," +
            "        { name : \"拉亞漢堡\", lat : 24.9603397, lon : 121.4197583,  tel : \"02 2268 1172\",  addr : \"新北市土城區中央路四段58號\"}," +
            "        { name : \"喜多多早餐店\", lat : 24.9651009, lon : 121.4303165,  tel : \"02 2268 1776\",  addr : \"新北市土城區中央路三段198號\"}," +
            "        { name : \"咪兒咖啡早午餐\", lat : 24.9596, lon : 121.4186336,  tel : \" 02 2268 6638\",  addr : \"新北市土城區中央路四段90號\"}" +
            "        ]}," +
            "        {stat : \"頂埔\" , time : \"下午茶\", foods : [" +
            "        { name : \"貓腳丫咖啡\", lat : 24.9590178, lon : 121.4175953,  tel : \"(02)2269-1315\",  addr : \"新北土城區中央路四段132-5號\"}" +
            "        ]}," +
            "        {stat : \"頂埔\" , time : \"聚餐\", foods : [" +
            "        { name : \"頂埔伍麵線甜不辣\", lat : 24.9562328, lon : 121.413781299999,  tel : \"02 2267 5866\",  addr : \"新北市土城區中央路四段310號\"}," +
            "        { name : \"海瑛越南牛肉河粉\", lat : 24.9652966, lon : 121.420249199999,  tel : \"02 2269 2295\",  addr : \"新北市土城區福安街2-1號\"}," +
            "        { name : \"金鼎焢肉飯\", lat : 24.9576123, lon : 121.4162599,  tel : \"02 2268 0024\",  addr : \"新北市中央路四段土城區\"}" +
            "        ]}]";

/*
class Foods {
        String stat;
        String time;
        List<String> foods;

        public Foods(String stat, String time, String... foods) {        //String... = String, String, String.......
            this.stat = stat;
            this.time = time;
            this.foods = new ArrayList<>();
            for(int i = 0; i < foods.length; i++) {
                this.foods.add(foods[i]);
            }
        }
    }
*/
/*
    Foods[] foods = {
            new Foods("南港展覽館", "早午餐", "小南港-懶人私廚"),
            new Foods("南港展覽館", "下午茶", "Ratio Coffee", "S one Cafe'"),
            new Foods("南港展覽館", "聚餐", "武侍酒日式居酒屋", "餡老滿", "樂雅樂"),
            new Foods("南港", "早午餐", "貳樓", "漾漾好時餐廳"),
            new Foods("南港", "下午茶", "杏桃鬆餅屋", "鼓豆咖啡", "Conch Baking 手作餅乾烘焙屋" ,"南港CHAFFEE"),
            new Foods("南港", "聚餐", "敘日全日餐廳", "大肆鍋物", "豆腐村", "高麗園韓式烤肉"),
            new Foods("昆陽", "早午餐", "Bocy Patisserie & Bistro", "Routine"),
            new Foods("昆陽", "下午茶", "Bocy Patisserie & Bistro", "Routine"),
            new Foods("昆陽", "聚餐", "二郭頭", "穀旦云涮涮鍋"),
            new Foods("後山埤", "早午餐", "N+n 喫早餐", "點子營養早餐吧", "藍色早餐吧"),
            new Foods("後山埤", "下午茶", "布蘭梅德國下午茶館", "B", "C"),
            new Foods("後山埤", "聚餐", "輕鬆私房菜", "竹村居酒屋"),
            new Foods("永春", "早午餐", "Mr.papa Waffle&Cafe比利時鬆餅", "Mr.Old", "城翔早午餐"),
            new Foods("永春", "下午茶", "聞山咖啡", "咖竅 Cotcha Coffee", "ERZMOMENT 笛瑟甜點工坊", "Colive Tea"),
            new Foods("永春", "聚餐", "古記雞.信義店.私房菜居酒屋", "小人大食", "小鮮肉涮涮屋"),
            new Foods("市政府", "早午餐", "HIVE巢", "We & Me Cafe"),
            new Foods("市政府", "下午茶", "LeTAO小樽洋?子舖", "佳佳甜品"),
            new Foods("市政府", "聚餐", "韓姜熙的小廚房", "WOOSAN", "韓斤麻浦", "靜岡勝政日式豬排", "丸龜製麵"),
            new Foods("國父紀展館", "早午餐", "At First Brunch 緣來早午餐", "Moi Cafe"),
            new Foods("國父紀展館", "下午茶", "微兜", "Street Churros", "Toast Chat"),
            new Foods("國父紀展館", "聚餐", "alamode Tabl", "Dancing Pig 豬跳舞小餐館", "潭洞韓式燒烤餐廳", "泰滾 Rolling Thai 泰式火鍋"),
            new Foods("忠孝敦化", "早午餐", "貓咪先生的朋友", "Pinknic野餐吧", "初衣食午 One Fifteen", "BIG TIME美式靈魂早午餐"),
            new Foods("忠孝敦化", "下午茶", "若水臨品鍋", "尚咖啡", "草莓工房"),
            new Foods("忠孝敦化", "聚餐", "啤調客 Beeru", "叁和院(參和院)台灣風格飲食", "胖東西廚房 CoolZi", "花酒藏 A-Plus"),
            new Foods("忠孝復興", "早午餐", "樂。野食", "紙箱外的貓腳印", "悄悄好食"),
            new Foods("忠孝復興", "下午茶", "紅豆食府", "PINEDE", "Tartine Bakery"),
            new Foods("忠孝復興", "聚餐", "菜豚屋", "川巴子熱炒", "WOODSTONE 木石披薩餐廳"),
            new Foods("忠孝新生", "早午餐", "光合箱子", "天和鮮物", "以馬內利鮮魚湯", "杭州小籠包"),
            new Foods("忠孝新生", "下午茶", "遠流別境 libLAB", "幾米品牌概念店", "建北黑砂糖剉冰", "貓下去 MEOWVELOUS CAFÉ"),
            new Foods("忠孝新生", "聚餐", "小姑食記", "橋下大叔", "陳記燒臘"),
            new Foods("善導寺", "早午餐", "烤司院碳烤吐司專賣", "阜杭豆漿", "丘比手作吐司早午餐", "艾搗蛋手工蛋餅"),
            new Foods("善導寺", "下午茶", "二條通綠島小夜曲", "Monteur 夢甜屋洋菓子店", "KONAYUKI 粉雪北海道 Style Cafe", "Bonnie Sugar"),
            new Foods("善導寺", "聚餐", "韓之棧", "青葉新樂園", "美麗島沖繩風味居酒屋"),
            new Foods("台北車站", "早午餐", "蛋要酷手工蛋餅專賣店", "Nola Kitchen 紐澳良小廚", "Tame Moose", "Coco Brother 椰 兄弟"),
            new Foods("台北車站", "下午茶", "小器食堂", "Dazzling Cafe 蜜糖吐司", "DIAMOND BEAR 鑽石熊烘焙", "天糖時尚燉奶甜品"),
            new Foods("台北車站", "聚餐", "明德素食園", "元泰食創意料理", "Nancy No.6 Apt 南西六號公寓"),
            new Foods("西門", "早午餐", "貳拾陸巷 Somebody Café", "花嘴廚房", "In% HAIR Salon & café", "金花碳烤吐司專賣"),
            new Foods("西門", "下午茶", "Guru House", "八拾捌茶輪番所", "譚仔三哥米線", "點水樓", "武昌街老天祿滷味"),
            new Foods("西門", "聚餐", "amba意舍吃吧chiba", "梅村日本料理", "嚐飽圖", "打狗霸"),
            new Foods("龍山寺", "早午餐", "NEST burger", "日初Moni Café", "煮飯研究所"),
            new Foods("龍山寺", "下午茶", "蘇家肉圓油粿", "豐原排骨酥", "布袋鮮之蚵", "三六仔圓店"),
            new Foods("龍山寺", "聚餐", "艋舺夜市 / 蔥抓餅", "艋舺夜市 / 山豬肉香腸", " 艋舺夜市 / 東港旗魚黑輪", "懷念愛玉冰", "北港甜湯"),
            new Foods("江子翠", "早午餐", "石頭肉圓", "厝邊", "無店名蛋餅", "老王豆漿店"),
            new Foods("江子翠", "下午茶", "艾白旅生 Alba Cafe", "Mr. Butter 奶油先生", "藍色微光"),
            new Foods("江子翠", "聚餐", "小喬新疆羊肉串", "彭園湘菜館", "9%酒趴旋轉串燒Bar", "鉄工場專賣燒肉"),
            new Foods("新埔", "早午餐", "OVEN COFFEE", "咖樂 Show the Color", "甜福Fuku Brunch", "PUCHI LOFT 小倉庫早午餐", "FOUND HOUSE 方屋餐廳"),
            new Foods("新埔", "下午茶", "MATTER CAFÉ", "Oyami Café", "翁林林Café", "182 Pancake", "巷左轉"),
            new Foods("新埔", "聚餐", "NU PASTA杯杯麵", "長鼻子泰式咖哩", "Box Diner", "鄰居家 Next Door", "豐華小館"),
            new Foods("板橋", "早午餐", "TOAST BOX", "Hivi Brunch", "好初早餐 Deli", "N.Y. BAGELS", "merci café"),
            new Foods("板橋", "下午茶", "亞尼克果子工房", "跳舞香水perfume dance", "典藏33", "Awhile 外兒小館", "糖村"),
            new Foods("板橋", "聚餐", "梁季港式小火鍋", "AIYA 藍屋日本料理", "聚．北海道昆布鍋", "Howfun 好飯食堂", "開飯川食堂"),
            new Foods("府中", "早午餐", "灣島 呷早頓", "第46號倉庫早午餐", "板橋三隻小豬", "Vicking's cafe 維京女王", "野豬核桃早午餐"),
            new Foods("府中", "下午茶", "Caffe bene", "Wapasta 義磚義瓦", "Melbourne Press Café", "Jouons Ensemble Pâtisserie", "微時光"),
            new Foods("府中", "聚餐", "原燒", "六必居潮州沙鍋粥", "隱居 いざかや居酒屋", "新野町燒肉居酒屋", "新葡苑餐廳"),
            new Foods("亞東醫院", "早午餐", "向陽晨間飲食館", "維京女王", "花吃", "多來家CAFÉ"),
            new Foods("亞東醫院", "下午茶", "NU PASTA杯杯麵", "米迦千層乳酪蛋糕專賣店", "歐客佬咖啡農場", "稻町森法式甜點舖"),
            new Foods("亞東醫院", "聚餐", "薩莉亞義式餐廳", "舒果", "哈瓦那", "有乾人麻辣火鍋"),
            new Foods("海山", "早午餐", "早安公雞", "Homa 咖啡", "怡客咖啡"),
            new Foods("海山", "下午茶", "醍味咖啡簡餐下午茶", "馬可先生麵包坊", "ANTLER PARK 鹿角公園"),
            new Foods("海山", "聚餐", "彼得公雞地中海餐廳", "漉", "阿城鵝肉"),
            new Foods("土城", "早午餐", "蕃茄村漢堡"),
            new Foods("土城", "下午茶", "找餐先生"),
            new Foods("土城", "聚餐", "饗饌", "御廚巨籠宴", "石頭日式炭火燒肉"),
            new Foods("永寧", "早午餐", "紫的寶", "金食堂 三隻熊"),
            new Foods("永寧", "下午茶", "AMO阿默典藏蛋糕"),
            new Foods("永寧", "聚餐", "永寧二號出口牛肉麵", "泰之雲泰式料理", "和春日式料理", "五八烏龍麵", "幸福咖哩"),
            new Foods("頂埔", "早午餐", "彎Corner", "福利早餐店", "拉亞漢堡", "喜多多早餐店", "咪兒咖啡早午餐"),
            new Foods("頂埔", "下午茶", "貓腳丫咖啡"),
            new Foods("頂埔", "聚餐", "頂埔伍麵線甜不辣", "海瑛越南牛肉河粉", "金鼎焢肉飯"),
    };
*/
    Foods2 foods2;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_food);
        Bundle b = getIntent().getExtras();         //從intent取得bundle
        String str1 = b.getString("mrtstat");
        String str2 = b.getString("timelist");
        mrt = findViewById(R.id.textView3);
        tim = findViewById(R.id.textView4);
        listview = findViewById(R.id.listView);
        final List<Foods2> foods2List = new Gson().fromJson(foodJson, new TypeToken<List<Foods2>>(){}.getType());

        mrt.setText(str1);
        tim.setText(str2);

        for(int i = 0; i < foods2List.size(); i++) {
            if(foods2List.get(i).stat.equals(str1)&&foods2List.get(i).time.equals(str2)) {
                foods2 = foods2List.get(i);
            }
        }//找到那個站的那個時段的資料

        ArrayList<String> foodsString = new ArrayList<>();
        for(int i = 0; i < foods2.foods.size(); i++) {
            foodsString.add(foods2.foods.get(i).name);      //把每一間店的名稱放進String的陣列   所以這裡只取name放進List
        }

        adapter = new ArrayAdapter(this, android.R.layout.simple_list_item_1, foodsString);     //第三個參數要型態為ArrayList<String>  但是foods2.foods是List<Food>
        listview.setAdapter(adapter);
        listview.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> parent, View view, int position, long id) {
               Food food = foods2.foods.get(position);
               Intent intent = new Intent(food.this, map.class);
               Bundle bundle = new Bundle();
               bundle.putString("json", new Gson().toJson(food));
               intent.putExtras(bundle);
               startActivity(intent);
            }
        });
    }
}
